drifting-cloudlet/smart_helmet/board/MCUX_Config/board/pin_mux.c
		const port_pin_config_t p3_13_pin_config = {
				kPORT_PullUp,
				kPORT_LowPullResistor,
				kPORT_FastSlewRate,
				kPORT_PassiveFilterDisable,
				kPORT_OpenDrainDisable,
				kPORT_LowDriveStrength,
				kPORT_NormalDriveStrength,
				kPORT_MuxAlt3,    // LPUART3 RXD
				kPORT_InputBufferEnable,
				kPORT_InputNormal,
				kPORT_UnlockRegister
		};
		PORT_SetPinConfig(PORT3, 9U, &p3_13_pin_config);   // 配置为 LPUART1 RXD
		
		
    const port_pin_config_t port3_12_pin63_config = {/* Internal pull-up resistor is enabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainEnable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as LPUART0_TXD */
                                                     kPORT_MuxAsGpio,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT3_12 (pin 63) is configured as LED_RED */
    PORT_SetPinConfig(PORT3, 12U, &port3_12_pin63_config);

																										 
#ifdef BSP_USING_SPI1
    const port_pin_config_t port2_12_pin34_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as LPSPI1_SCK */
                                                     kPORT_MuxAlt2,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_12 (pin 34) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(PORT2, 12U, &port2_12_pin34_config);

    const port_pin_config_t port2_13_pin35_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as LPSPI1_SDO */
                                                     kPORT_MuxAlt2,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_13 (pin 35) is configured as LPSPI1_SDO */
    PORT_SetPinConfig(PORT2, 13U, &port2_13_pin35_config);

    const port_pin_config_t port2_16_pin37_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as LPSPI1_SDI */
                                                     kPORT_MuxAlt2,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_16 (pin 37) is configured as LPSPI1_SDI */
    PORT_SetPinConfig(PORT2, 16U, &port2_16_pin37_config);

    const port_pin_config_t port2_6_pin28_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    kPORT_NormalDriveStrength,
                                                    /* Pin is configured as LPSPI1_PCS1 */
                                                    kPORT_MuxAsGpio,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT2_6 (pin 20) is configured as LPSPI1_PCS1 */
    PORT_SetPinConfig(PORT2, 6U, &port2_6_pin28_config);
#endif

#ifdef BSP_USING_I2C0
    /* 配置 I2C0 (LPI2C0) 引脚
     * FRDM-MCXA156: P0_16=LPI2C0_SDA, P0_17=LPI2C0_SCL (Arduino 接口)
     */

    const port_pin_config_t i2c0_sda_config = {
        /* Internal pull-up resistor is enabled (I2C需要上拉) */
        kPORT_PullUp,
        /* Low internal pull resistor value */
        kPORT_LowPullResistor,
        /* Fast slew rate */
        kPORT_FastSlewRate,
        /* Passive input filter is disabled */
        kPORT_PassiveFilterDisable,
        /* Open drain MUST be enabled for I2C */
        kPORT_OpenDrainEnable,
        /* Low drive strength */
        kPORT_LowDriveStrength,
        /* Normal drive strength */
        kPORT_NormalDriveStrength,
        /* Pin is configured as LPI2C0_SDA */
        kPORT_MuxAlt5,  /* P0_16 的 Alt5 功能是 LPI2C0_SDA */
        /* Digital input enabled */
        kPORT_InputBufferEnable,
        /* Digital input is not inverted */
        kPORT_InputNormal,
        /* Unlock register */
        kPORT_UnlockRegister
    };
    /* PORT0_16 配置为 LPI2C0_SDA */
    PORT_SetPinConfig(PORT0, 16U, &i2c0_sda_config);

    const port_pin_config_t i2c0_scl_config = {
        /* Internal pull-up resistor is enabled (I2C需要上拉) */
        kPORT_PullUp,
        /* Low internal pull resistor value */
        kPORT_LowPullResistor,
        /* Fast slew rate */
        kPORT_FastSlewRate,
        /* Passive input filter is disabled */
        kPORT_PassiveFilterDisable,
        /* Open drain MUST be enabled for I2C */
        kPORT_OpenDrainEnable,
        /* Low drive strength */
        kPORT_LowDriveStrength,
        /* Normal drive strength */
        kPORT_NormalDriveStrength,
        /* Pin is configured as LPI2C0_SCL */
        kPORT_MuxAlt5,  /* P0_17 的 Alt5 功能是 LPI2C0_SCL */
        /* Digital input enabled */
        kPORT_InputBufferEnable,
        /* Digital input is not inverted */
        kPORT_InputNormal,
        /* Unlock register */
        kPORT_UnlockRegister
    };
    /* PORT0_17 配置为 LPI2C0_SCL */
    PORT_SetPinConfig(PORT0, 17U, &i2c0_scl_config);

    /* Release LPI2C0 reset */
    RESET_ReleasePeripheralReset(kLPI2C0_RST_SHIFT_RSTn);
#endif

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
